API/Tests/FlightReservation/Result7/Report/Data/Step4.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity7</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity7_InputXml_a682f210-f287-4649-8215-703d56de2f88.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;Body&gt;
    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;FlightOrder&gt;
        &lt;Class&gt;Economy&lt;/Class&gt;
        &lt;CustomerName&gt;Rakesh Krishnan&lt;/CustomerName&gt;
        &lt;DepartureDate&gt;2025-01-14T00:00:00+05:30&lt;/DepartureDate&gt;
        &lt;FlightNumber&gt;17979&lt;/FlightNumber&gt;
        &lt;NumberOfTickets&gt;2&lt;/NumberOfTickets&gt;
      &lt;/FlightOrder&gt;
    &lt;/CreateFlightOrder&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">Flights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">CreateFlightOrder</Operation><Address name="Address">http://localhost:8000/Flights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity7_Full_request_b4224e3e-f7da-4df1-b203-a76802bcf05d.xml">&lt;?xml version="1.0"? ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder
Content-Type:	text/xml; charset=utf-8
Host:	localhost:8000
Content-Length:	421
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	342
Content-Type:	text/xml; charset=utf-8
Date:	Mon, 06 Jan 2025 11:27:01 GMT
Server:	Microsoft-HTTPAPI/2.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;OrderNumber&gt;97&lt;/OrderNumber&gt;&lt;TotalPrice&gt;1076.82007&lt;/TotalPrice&gt;&lt;/CreateFlightOrderResult&gt;&lt;/CreateFlightOrderResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity7_OutputXml_0b1804e3-367c-42eb-9558-d0180793a69d.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;OrderNumber&gt;97&lt;/OrderNumber&gt;
        &lt;TotalPrice&gt;1076.82007&lt;/TotalPrice&gt;
      &lt;/CreateFlightOrderResult&gt;
    &lt;/CreateFlightOrderResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'CreateFlightOrder'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>